[
  {
    "id": "0",
    "text": "بِسْمِ اللَّهِ الرَّحْمَـٰنِ الرَّحِيم",
    "translate": "شروع الله کا نام لے کر جو بڑا مہربان نہایت رحم والا ہے",
    "tafsir": ""
  },
  {
    "id": "1",
    "text": "يسٓ",
    "translate": "یسۤ",
    "tafsir": ""
  },
  {
    "id": "2",
    "text": "وَالْقُرْآنِ الْحَكِيمِ",
    "translate": "قسم ہے قرآن کی جو حکمت سے بھرا ہوا ہے",
    "tafsir": ""
  },
  {
    "id": "3",
    "text": "إِنَّكَ لَمِنَ الْمُرْسَلِينَ",
    "translate": "بے شک آپ رسولوں میں سے ہیں",
    "tafsir": ""
  },
  {
    "id": "4",
    "text": "عَلَىٰ صِرَاطٍ مُسْتَقِيمٍ",
    "translate": "سیدھے راستے پر  ف2",
    "tafsir": "ف2 یعنی قرآن کریم اپنی اعجازی شان، پر حکمت تعلیمات، اور پختہ مضامین کے لحاظ سے بڑا زبردست شاہد اس بات کا ہے کہ جو نبی امی اس کو لے کر آیا یقینا وہ اللہ کا بھیجا ہوا اور بیشک و شبہ سیدھی راہ پر ہے۔ اس کی پیروی کرنے والوں کو کوئی اندیشہ منزل مقصود سے بھٹکنے کا نہیں۔"
  },
  {
    "id": "5",
    "text": "تَنْزِيلَ الْعَزِيزِ الرَّحِيمِ",
    "translate": "غالب رحمت والے کا اتارا ہوا ہے ف3",
    "tafsir": "ف3 یعنی یہ دین کا سیدھا راستہ یا قرآن حکیم اس خدا کا اتارا ہوا ہے جو زبردست بھی ہے کہ منکر کو سزا دیے بغیر نہ چھوڑے، اور رحم فرمانے والا بھی کہ ماننے والوں کو نوازش و بخشش سے مالا مال کر دے۔ اسی لیے آیات قرآنیہ میں بعض آیات شان لطف و مہر کا اور بعض شان عنب و قہر کا پہلو لیے ہوئے ہیں۔"
  },
  {
    "id": "6",
    "text": "لِتُنْذِرَ قَوْمًا مَا أُنْذِرَ آبَاؤُهُمْ فَهُمْ غَافِلُونَ",
    "translate": "تاکہ آپ اس قوم کو ڈرائیں جن کے باپ دادا نہیں ڈرائے گئے سو وہ غافل ہیں",
    "tafsir": ""
  },
  {
    "id": "7",
    "text": "لَقَدْ حَقَّ الْقَوْلُ عَلَىٰ أَكْثَرِهِمْ فَهُمْ لَا يُؤْمِنُونَ",
    "translate": "ان میں سے اکثر پر خدا کافرمان پورا ہو چکا ہے پس وہ ایمان نہیں لائیں گے ف4",
    "tafsir": "ف4 یعنی بہت کٹھن کام آپ کے سپرد ہوا ہے کہ اس قوم (عرب) کو آپ قرآن کے ذریعہ سے ہوشیار و بیدار کریں۔ جس کے پاس صدیوں سے کوئی جگانے والا نہیں بھیجا تھا۔ وہ جاہل و نافل قوم جسے نہ خدا کی خبر نہ آخرت کی، نہ مانی سے عبرت نہ مستقبل کی فکر، نہ مبداء پر نظر نہ منتهاء پر، نہ نیک و بد کی تمیز نہ بھلے برے کا شعور اس کو اتنی ممتد جہالت و غفلت کی اندھیروں سے نکال کر رشد و ہدایت کی صاف سڑک پر لاکھڑا کرنا کوئی معمولی اور سال کام نہیں ہے۔ بلاشبہ آپ صلی اللہ علیہ وسلم پوری قوت اور زور شور کے ساتھ ان کو اس غفلت و جہالت کے خوفناک نتائج اور بھیانک مستقبل سے ڈرا کر فلاح و بہبود کے اعلی مدارج پر پہنچانے کی کوشش کریں گے تاکہ یہ قوم اپنی اعلی کامیابی سے تمام عالم کے لیے کامیابی کا دروازہ کھول دے۔ لیکن بہت افراد وہ ملیں گے جو کسی قسم کی نصیحت پر کان دھرنے والے نہیں۔ اسی لیے ان پر سے شیطان پوری طرح مسلط ہو جاتا ہے جو ان کی حماقتوں اور شرارتوں کو ان کی نگاہ میں خوشنما کر کے دکھلانا اور اگلے پچھلے سب احوال کو خواہ کتنے ہی گندے ہوں. خوبصورت بنا کر ظاہر کرتا ہے۔ آخر یہ لوگ دوسری زندگی سے بالکل منکر ہو کر اپنی فانی خو کو قبلہ مقصود ٹھہرا لیتے ہیں۔ اس وقت ایک طرف سے شیطان کی بات \"لاعوينهم اجمعين الاعبادك منهم المخلصين\" (مخلصین کے سوا میں سب کو بہکا کر رہوں گا) سچی ہوئی ہے اور دوسری طرف حق تعالی کا قول \"لایلان جهنم منک و ممن تبعک منهم اجمعین\" تمجھ سے اور تیرے پیروؤں سے دوزخ کو بھر دوں گا) ثابت اور چسپاں ہو جاتا ہے۔ باقی علم الہی میں تو ازل سے ثابت ہے کہ فلاں قوم کے خلاں فلاں افراد اپنی بد تمیزی اور لاپروائی سے شیطان کے اعواء میں پہنس کر عذاب الہی کے مستحق ہوں گے ایسے لوگوں کے راہ پر آنے اور ماننے کی کیا توقع ہوسکتی ہے پس آ نا ہو سکتی ہے پس آپ کو سلسلہ انداز و اصلاح میں اگر ایسے ہمت ۔ فر ایسے ہمت شکن واقعات کا مقابلہ کرنا پڑے تو ملول و غمگین نہ ہوں اپنا فرض ادا کیے جائیں اور نتیجہ کو خدا کے سپرد کر دیں۔ تقریر بالا کو سمجھنے کے لیے یہ آیات پیش نظر رکھیے۔ (۱) \"ومن یعش عن ذكر الرحمن تفسیش له شینا نا فحوله قرین وانهم ليصدونهم عن السبيل ويحسبون انهم مهتدون ۔ \" (زخرف ، رکوع ۴) معلوم ہوا کہ شیطان ابتداء کسی پر مسلط نہیں کیا جاتا۔ بلکہ اندھا بن کر نصیحت سے اعراض کرتے رہنے کا اثر یہ ہوتا ہے کہ آخر کار شیطان مسلط ہو جائے جیسے ہاتھ پاؤں سے مدت تک کام نہ لے تو وہ عضو بیکار کر دیا جاتا ہے۔ قال تعالی \"فلما زاعوآ ازاع الله قلوبهم \" (الست، رکوع ۱ ) \"و نقلب افتند تنهم وابصار بم كمالم یومنوا به اول مرة و نذر بهم في طغیانهم یعمهون۔ \"(انعام ، رکوع ۱۳) (ب) \"وقیننا لهم ق نار فزينوا لهم ما بين ايديهم وما وحق عليهم القول في امم \"( تم السحده، رکوع۳) تسلط کے بعد شیطان یہ کام کرتا ہے جس کا نتیجہ \"خلق عليهم القول \" ہے (ج) \"والذي قال لوالد یہ ان لكما اتعدا ننى ان الخرج وقد خلت القرون من قبلي و بما يستخیشان الله و ملک امن ان وعد الله حق فيقول ماذا الا اساطیر الاولین اولئک الذین حق عليهم القول في ام \" (الاحقاف، رکوع ۲) ان آیات سے معلوم ہوا کہ لفظ \"حق القول\" ان لوگوں پر صادق آتا ہے جو موت کے بعد کی دوسری زندگی کا یقین ہی نہیں رکھتے، نہ برائی کو برائی سمجھتے ہیں، بلکہ اعوائے شیطانی سے اپنی بدیوں کو نیکی اور گمراہی کو ہدایت تصور کر لیتے ہیں۔ کیسے ہی معقول دلائل سنائیے اور کھلے کھلے نشان دکھلائیے، سب کو جھٹلاتے رہیں اور فضول حجتیں نکالتے رہیں، بظاہر بادیوں اور پیغمبروں کی بات کی طرف کان جو کائیں مگر ایک حرف سمجھنے کی کوشش نہ کریں۔ محض ہوا و ہوس کو اپنا معبود ٹھہرا لیں نہ عقل سے کام لیں نہ آنکھوں سے، یہ ہی لوگ ہیں جن کے اعراض و عناد کے نتیجہ میں آخر کار اللہ تعالی دلوں پر مہر کر دیتا ہے کہ ان میں خیر کے گھنے کی پھر ذرا گنجائش نہیں رہتی۔ جیسے کوئی شخص اپنے اوپر روشنی کے سب دروازے بند کرلے تو اللہ تعالی اس کو اندھیرے میں چھوڑ دیتا ہے یا ایک بیمار دوا پینے کی قسم کھا لے، طبیب سے روشنی کرے اور ہر قسم کی بد پرہیزی پر تیار ہو جائے تو اللہ اس کے مرض کو مہلک بنا دیتا اور مایوسی کے درجہ میں پہنچا دیتا ہے۔"
  },
  {
    "id": "8",
    "text": "إِنَّا جَعَلْنَا فِي أَعْنَاقِهِمْ أَغْلَالًا فَهِيَ إِلَى الْأَذْقَانِ فَهُمْ مُقْمَحُونَ",
    "translate": " بے شک ہم نے ان کی گردنوں میں طوق ڈال دیے ہیں پس وہ ٹھوڑیوں تک ہیں سو وہ اوپر کو سر اٹھائے ہوئے ہیں ف5",
    "tafsir": "ف5 یہ ان ہی لوگوں کے حق میں ہے جن کا ذکر گزشتہ فائدہ میں ہوا۔ یہ طوق عادات و رسوم حب جاہ و مال اور تقلید آباء و اجداد کے تھے جنہوں نے ان کے گھنے سختی سے دبا رکھے تھے اور نخوت و تکبر کی وجہ سے ان کے سر نیچے نہیں جھکتے تھے۔"
  },
  {
    "id": "9",
    "text": "وَجَعَلْنَا مِنْ بَيْنِ أَيْدِيهِمْ سَدًّا وَمِنْ خَلْفِهِمْ سَدًّا فَأَغْشَيْنَاهُمْ فَهُمْ لَا يُبْصِرُونَ",
    "translate": "اور ہم نے ان کے سامنے ایک دیواربنادی ہے اور ان کے پیچھے بھی ایک دیوارہے پھر ہم نے انہیں ڈھانک دیا ہے کہ وہ دیکھ نہیں سکتے ف6",
    "tafsir": "ف6 نسبی کی عداوت نے ان کے اور قبول ہدایت کے درمیان دیوار میں کھڑی کر دی تھیں۔ جاہلانہ رسوم و اطوار اور اہواء و آرائے فاسدہ کی اندھیر یوں میں اس طرح بند تھے کہ اگلا پہنچا اور نشیب و فراز کچھ نظر نہ آتا تھا۔ نہ مانی پر نظر تھی نہ مستقبل پر، باقی ان افعال کی نسبت حق تعالی کی طرف سے اس لیے کہ گئی کہ خالق خیر و شر کا وہی ہے اور اسباب پر مسببات کا ترتب اسی کی مثیت سے ہوتا ہے۔ امام رازی فرماتے ہیں کہ اس آیت سے دلائل اتفاقیہ میں غور کرنے کی نفی ہوئی جیسا کہ \"قسم مضمون میں دلائل النفسیہ کی طرف ملتفت نہ ہونے کا اشارہ تھا۔ کیونکہ سر اوپر کو اٹھ رہا ہو جھک نہ سکے تو اپنے بدن پر نظر نہیں پڑ سکتی۔"
  },
  {
    "id": "10",
    "text": "وَسَوَاءٌ عَلَيْهِمْ أَأَنْذَرْتَهُمْ أَمْ لَمْ تُنْذِرْهُمْ لَا يُؤْمِنُونَ",
    "translate": "اور ان پر برابر ہے کیا آپ ان کو ڈرائیں یا نہ ڈرائیں وہ ایمان نہیں لائیں گے ف7",
    "tafsir": "ف7 ان کو برابر ہے لیکن آپ کے حق میں برابر نہیں، بلکہ ایسی سخت معاند اور سر ت معاند سرکش قوم کو نصیحت کرنا اور اصلاح کے درپے ہونا عظیم درجات کے حصول کا سبب ہے اور کبھی یہ اخلاق دوسروں کی ہدایت کا باعث بن جاتا ہے۔ اسی طرح کی آیات سورہ \"بترو\" کے اوائل میں گزر چکی ہیں۔"
  },
  {
    "id": "11",
    "text": "إِنَّمَا تُنْذِرُ مَنِ اتَّبَعَ الذِّكْرَ وَخَشِيَ الرَّحْمَـٰنَ بِالْغَيْبِ ۖ فَبَشِّرْهُ بِمَغْفِرَةٍ وَأَجْرٍ كَرِيمٍ",
    "translate": "بے شک آپ اسی کو ڈرا سکتے ہیں جو نصیحت کی پیروی کرے اوربن دیکھے رحمان سے ڈرے پس خوشخبری دے دو اس کو بخشش اوراجر کی جو عزت والا ہے ف1",
    "tafsir": "ف1 یعنی ڈرانے کا فائدہ اسی کے حق میں ظاہر ہوتا ہے جو نصیحت کو مان کر اس پر چلے اور اللہ کا ڈر دل میں رکھتا ہو۔ جس کو خدا کا ڈر ہی نہیں نہ نصیحت کی کچھ پروا، وہ نبی کی تنبیہ و تذکیر سے کیا فائدہ اٹھائے گا ایسے لوگ بجائے مغفرت و عزت کے سزا اور ذلت کے مستحق ہوں گے۔ آگے اشارہ کرتے ہیں کہ فریقین کی اس عزت و ذلت کا پورا اظہار زندگی کے دوسرے دور میں ہو گا جس کے مبادی موت کے بعد سے مشروع ہو جاتے ہیں۔"
  },
  {
    "id": "12",
    "text": "إِنَّا نَحْنُ نُحْيِي الْمَوْتَىٰ وَنَكْتُبُ مَا قَدَّمُوا وَآثَارَهُمْ ۚ وَكُلَّ شَيْءٍ أَحْصَيْنَاهُ فِي إِمَامٍ مُبِينٍ",
    "translate": "بے شک ہم ہی مردوں ف2 کو زندہ کریں گے اور جو انھوں نے آگے بھیجا اور جو پیچھے چھوڑا  ف3اس کو لکھتے ہیں اور ہم نے ہر چیز کو کتاب واضح (لوح محفوظ) میں محفوظ کر رکھا ہے ف4",
    "tafsir": "ف2 یعنی موت کے بعد دوسری زندگی یقینی ہے جہاں سب اپنے کیے کا بدلہ پائیں گے اور شاید ادھر بھی اشارہ ہو کہ یہ قوم (عرب) جس کی روحانی قوتیں بالکل مردہ ہو چکی ہیں، حق تعالی کو قدرت ہے کہ پھر ان میں زندگی کی روح پھونک دے کہ وہ دنیا میں بڑے بڑے کارہائے نمایاں کرے اور آنے والی نسلوں کے لیے اپنے آثار عظیمہ چھوڑ جائے۔\n\nف3 یعنی نیک و بد اعمال جو آگے بھیج چکے اور بعض اعمال کے اچھے برے اثرات یا نشان جو پہچھے چوڑے مثلا کوئی کتاب تصنیف کی یا علم سکھلایا، یا عمارت بنائی یا کوئی رسم ڈالی نیک یا بد، سب اس میں داخل ہیں بلکہ الفاظ کے عموم میں وہ نشان قدم بھی شامل ہو سکتے ہیں جو کسی عبادت کے لیے چلتے وقت زمین پر پڑ جاتے ہیں چنانچہ بعض احادیث صحیحہ میں تصریح ہے۔ \"دیار کم کتب آثار کم۔\"\nف4 یعنی جس طرح تمام اعمال و آثار و قوع کے بعد ضابطہ کے موافق لکھے جاتے ہیں، قبل از وقوع بھی ایک ایک چیز لوح محفوظ میں لکھی ہوئی ہے اور وہ لکھنا بھی محض انتظامی ضوابط و مصالح کی بناء پر ہے ورنہ اللہ کے عا قدیم میں ہر چھوٹی بڑی چیز پہلے سے موجود و حاظر ہے اسی کے موافق لوح محفوظ میں نقل کی جاتی ہے۔"
  },
  {
    "id": "13",
    "text": "وَاضْرِبْ لَهُمْ مَثَلًا أَصْحَابَ الْقَرْيَةِ إِذْ جَاءَهَا الْمُرْسَلُونَ",
    "translate": "اور ان سے بستی والوں ف5 کا حال مشال کے طور پر بیان کر جب کہ ان کے پاس رسول آئے ف6",
    "tafsir": "ف 5 یہ گاؤں اکثر کے نزدیک شہر \"انطاکیہ\" ہے۔ اور بائیبل کتاب اعمال کے آٹھویں اور گیارہویں باب میں ایک قصہ اسی قصہ کے مشابہ کچھ تفاوت کے ساتھ شہر انطاکیہ کا بیان ہوا ہے۔ لیکن اب کثیر نے تاریخی حیثیت سے اور سیاق قرآن کے لحاظ سے اس پر کچھ اعتراضات کیے ہیں۔ اگر وہ صحیح ہوں تو کوئی اور بستی ماننی پڑے گی واللہ اعلم ۔ اس قصہ کا ذکر مومنین کے لیے بشارت اور مکذبین کے لیے عبرت ہے۔ ف6 ان کے ناموں کی صحیح تعیین نہیں ہو سکتی اور نہ یقینی طور پر یہ کہا جاسکتا ہے کہ یہ بلاواسطہ اللہ تعالی کے بھیجے ہوئے پیغمبر تھے یا کسی پیغمبر کے واسطہ سے حکم ہوا تھا اس کے نائب ہو کر فلاں بستی کی طرف جاؤ۔ دونوں احتمال ہیں۔ گو متبادر یہ ہی ہے کہ پیغمبر ہوں۔ شاید حضرت مسیح علیہ السلام سے پہلے مبعوث ہوئے ہوں گے۔"
  },
  {
    "id": "14",
    "text": "إِذْ أَرْسَلْنَا إِلَيْهِمُ اثْنَيْنِ فَكَذَّبُوهُمَا فَعَزَّزْنَا بِثَالِثٍ فَقَالُوا إِنَّا إِلَيْكُمْ مُرْسَلُونَ",
    "translate": "جب ہم نے ان کے پاس دو کو بھیجا انھوں نے ان کو جھٹلایا پھر ہم نے تیسرے سے مدد کی پھر انہوں نے کہا ہم تمہاری طرف بھیجے گئے ہیں ف7",
    "tafsir": "ف7 یعنی اول دو گئے پھر ان کی تائید کے لیے تیسرا بھیجا گیا تینوں نے مل کر کھا ہم خود نہیں آئے، اللہ کے بھیجے ہوئے آئے ہیں۔ لہذا جو کچھ ہم کہیں اسی کا پیغام سمجھو۔"
  },
  {
    "id": "15",
    "text": "قَالُوا مَا أَنْتُمْ إِلَّا بَشَرٌ مِثْلُنَا وَمَا أَنْزَلَ الرَّحْمَـٰنُ مِنْ شَيْءٍ إِنْ أَنْتُمْ إِلَّا تَكْذِبُونَ",
    "translate": "انہوں نے کہا تم کچھ اور نہیں ہو مگر ہماری طرح انسان ہو اور رحمان نے کوئی چیز نہیں اتاری تم اور کچھ نہیں ہو مگر جھوٹ بول رہے ہو ف8",
    "tafsir": "ف8 یعنی تم میں کوئی سرخاب کا پر نہیں جو اللہ تمہیں بھیجتا۔ ہم سے کس بات میں تم بڑھ کر تھے۔ بس رہنے دو خواہ مخواہ خدا کا نام نہ لو۔ اس نے کچھ نہیں اتارا۔ تینوں سازش کر کے ایک جھوٹ بنا لائے اسے خدا کی طرف نسبت کر دیا۔"
  },
  {
    "id": "16",
    "text": "قَالُوا رَبُّنَا يَعْلَمُ إِنَّا إِلَيْكُمْ لَمُرْسَلُونَ",
    "translate": "انہوں نے کہا ہمارا رب جانتا ہے کہ ہم تمہاری طرف بھیجے ہوئے ہیں ف9",
    "tafsir": "ف9 یعنی اگر تم خدا پر مجھوٹ لگاتے ہیں تو وہ دیکھ رہا ہے۔ رہا ہے۔ کیا وہ اپنے فعل سے برابر جھوٹوں کی تصدیق کرتا رہے گا۔ ایسا نہیں ہو سکتا۔ اب تم سمجھو یا نہ سمجھو، اللہ تعالی خوب جانتا ہے کہ ہم اپنے دعوے میں سچے ہیں اور کوئی بات اپنی طرف سے نہیں کہہ رہے۔ اسی لیے فعلا بیماری تصدیق کر رہا ہے۔"
  },
  {
    "id": "17",
    "text": "وَمَا عَلَيْنَا إِلَّا الْبَلَاغُ الْمُبِينُ",
    "translate": "اورہمارے ذمے کھلم کھلا پہنچا دینا ہی ہے ف10",
    "tafsir": "ف 10 یعنی ہم اپنا فرض ادا کر چکے، خدا کا پیام خوب کھول کر واضع ، معقول اور دلنشیں طریقہ سے تم کو پہنچا دیا، اب اتمام صحبت کے بعد خود سوچ لو کہ تکذیب و عداوت کا انجام کیا ہونا چاہیے۔"
  },
  {
    "id": "18",
    "text": "قَالُوا إِنَّا تَطَيَّرْنَا بِكُمْ ۖ لَئِنْ لَمْ تَنْتَهُوا لَنَرْجُمَنَّكُمْ وَلَيَمَسَّنَّكُمْ مِنَّا عَذَابٌ أَلِيمٌ",
    "translate": "انہوں نے کہا ہم نے تو تمہیں منحوس سمجھا ہے اگر تم باز نہ آؤ گے توہم تمہیں سنگسار کر دیں گے اور تمہیں ہمارے ہاتھ سے ضرور دردناک عذاب پہنچے گا ف11",
    "tafsir": "ف11 شاید تکذیب مرسلین اور کفر و عناد کی شامت سے قوط وغیرہ پڑا ہو گا۔ یا مرسلین کے سمجھانے پر آپس میں اختلاف ہوا کسی نے مانا کسی نے نہ مانا، اس کو نامبارک کہا۔ یعنی تمہارے قدم کیا آئے، قحط اور نا اتفاقی کی بلا ہم پر ٹوٹ پڑی۔ یہ سب تمہاری نحوست ہے۔ (العیاذ باللہ ) ور نہ پہلے تم اچھے خاصے آرام چین کی زندگی بسر کر رہے تھے بس تم اپنے وعظ و نصیحت سے تم کو معاف رکھو۔ اگر یہ طریقہ نہ چھوڑو گے اور وعظ و نصیحت سے باز نہ آؤ گے تو ہم سخت تکلیف و عذاب پہنچا کر تم کو سنگسار کر ڈالیں گے۔"
  },
  {
    "id": "19",
    "text": "قَالُوا طَائِرُكُمْ مَعَكُمْ ۚ أَئِنْ ذُكِّرْتُمْ ۚ بَلْ أَنْتُمْ قَوْمٌ مُسْرِفُونَ",
    "translate": "انہوں نے کہا تمہاری نحوست تو تمہارے ساتھ ہے کیا اگر تمہیں نصیحت کی جائے (تو اسے نحوست سمجھتے ہو) بلکہ تم حد سے بڑھنے والے ہو ف12",
    "tafsir": "ف12 یعنی تمہارے گھر و تکذیب کی شامت سے عذاب آیا۔ اگر حق و صداقت کو سب مل کر قبول کر لیتے نہ یہ اختلاف مذموم پیدا ہونا، نہ اس طرح مبتلائے آفات ہوتے۔ پس نامبار کی اور نحوست کے اسباب خود تمہارے اندر موجود ہیں۔ پھر کیا اتنی بات پر کہ تمہیں اچھی نصیحت و فہمائش کی اور بھلا برا سمجھایا، اپنی نحوست ہمارے سر ڈالنے لگے۔ اور قتل کی دھمکیاں دینے لگے۔ حقیقت یہ ہے کہ تم عقل و آدمیت کی حدود سے خارج ہو جاتے ہو۔ نہ عقل سے سمجھتے ہو نہ آدمیت کی بات کرتے ہو۔"
  },
  {
    "id": "20",
    "text": "وَجَاءَ مِنْ أَقْصَى الْمَدِينَةِ رَجُلٌ يَسْعَىٰ قَالَ يَا قَوْمِ اتَّبِعُوا الْمُرْسَلِينَ",
    "translate": "اور شہر کے پرلے کنارے سے ایک آدمی دوڑتا ہوا آیا کہا اے میری قوم رسولوں کی پیروی کرو ف13",
    "tafsir": "ف 13 کھتے ہیں کہ اس مرد صالح کا نام حبیب تھا۔ شہر کے پرلے کنارے عبادت میں مشغول رہتا اور کسب حلال سے کھاتا تھا۔ فطر می صلاحیت نے چپ نہ بیٹھنے دیا۔ قصہ سنتے ہی مرسلین کی تائید و حمایت اور ملکذبین کی نصیحت و ضمائش کے لیے دوڑتا ہوا آیا۔ مبادا اشقیاء اپنی دھمکیوں کو پورا کرنے لگیں۔ اس سے ظاہر ہوتا ہے کہ مرسلین کی آواز کا اثر شہر کے دور دراز حصوں تک پہنچ گیا تھا۔"
  },
  {
    "id": "21",
    "text": "اتَّبِعُوا مَنْ لَا يَسْأَلُكُمْ أَجْرًا وَهُمْ مُهْتَدُونَ",
    "translate": "ان کی پیروی کرو جو تم سےکوئی اجر نہیں مانگتے اوروہ ہدایت پانے والے ہیں ف14",
    "tafsir": "ف14 یعنی اللہ کے بھیجے ہوئے ہیں۔ اس کا پیغام لے کر آئے ہیں جو نصیحت کرتے ہیں اس پر خود کار بند ہیں اخلاق، اعمال اور عادات و اطوار سب ٹھیک ہیں۔ پھر ایسے بے لوث بزرگوں کا اتباع کیوں نہ کیا جائے اور اللہ تعالی ان کے ذریعہ سے جو پیغام بھیجے کیوں قبول نہ کیا جائے۔"
  },
  {
    "id": "22",
    "text": "وَمَا لِيَ لَا أَعْبُدُ الَّذِي فَطَرَنِي وَإِلَيْهِ تُرْجَعُونَ",
    "translate": "اور میرے لیے کیا ہے کہ میں اس کی عبادت نہ کروں جس نے مجھے پیدا ف1 کیا ہے اور اسی کی طرف تم لوٹائے جاؤ گے ف2",
    "tafsir": " ف1 یہ اپنے اوپر رکھ کر دوسروں کو سنایا۔ یعنی تم کو اسٹر کیا ہوا کہ جس نے پیدا کیا اس کی بندگی نہ کرو۔ ف 2 یعنی یہ مت سمجھنا کہ پیدا کر کے آزاد چھوڑ دیا ہے۔ اب کچھ منا مطلب اس سے نہیں رہا۔ نہیں، سب کو مرے پیچھے اسی کے پاس واپس جانا ہے۔ اس وقت کی فکر کر رکھو۔"
  },
  {
    "id": "23",
    "text": "أَأَتَّخِذُ مِنْ دُونِهِ آلِهَةً إِنْ يُرِدْنِ الرَّحْمَـٰنُ بِضُرٍّ لَا تُغْنِ عَنِّي شَفَاعَتُهُمْ شَيْئًا وَلَا يُنْقِذُونِ",
    "translate": "کیا میں اس کے سوا اوروں کو معبود بناؤں کہ اگر رحمان مجھے تکلیف دینے کا ارادہ کرے تو ان کی سفارش کچھ بھی میرے کام نہ آئے اور نہ وہ مجھے چھڑا سکیں",
    "tafsir": ""
  },
  {
    "id": "24",
    "text": "إِنِّي إِذًا لَفِي ضَلَالٍ مُبِينٍ",
    "translate": "بے شک تب میں صریح گمراہی میں ہوں گا ف3",
    "tafsir": "ف3 یعنی کس قدر صریح گمراہی ہے کہ اس مہربان اور قادر مطلق پروردگار کو چھوڑ کر ایسی چیزوں کی پرستش کی جائے جو خدا کی بھیجی ہوئی کسی تکلیف سے نہ بذات خود مچڑا سکیں نہ سفارش کر کے نجات دلا سکیں۔"
  },
  {
    "id": "25",
    "text": "إِنِّي آمَنْتُ بِرَبِّكُمْ فَاسْمَعُونِ",
    "translate": "بے شک میں تمہارے رب پر ایمان لایا پس میری بات سنو ف4",
    "tafsir": " ف4 یعنی مجمع میں بے کھٹکے اعلان کرتا ہوں کہ میں خدائے واحد پر ایمان لا چکا۔ اسے سب سن رکھیں شاید مرسلین کو اس لیے سنایا ہو کہ وہ اللہ کے ہاں گواہ رہیں اور قوم کو اس لیے کہ سن کر کچھ متاثر ہوں یا کم از کم دنیا ایک مومن کی قوت ایمان کا مشاہدہ کرنے کی طرف متوجہ ہو۔"
  },
  {
    "id": "26",
    "text": "قِيلَ ادْخُلِ الْجَنَّةَ ۖ قَالَ يَا لَيْتَ قَوْمِي يَعْلَمُونَ",
    "translate": "کہا گیا جنت میں داخل ہو جا اس نے کہا اے کاش! میری قوم بھی جان لیتی ف5",
    "tafsir": "ف5 یعنی فورا بہشت کا پروانہ مل گیا۔ آگے نقل کرتے ہیں کہ قوم نے اس کو نہایت بیدردی کے ساتھ شہید کر ڈالا۔ ادھر شہادت واقع ہوئی ادھر سے حکم ملا کہ فوراً بہشت میں داخل ہو جا۔ جیسا کہ ارواح شہداء کی نسبت احادیث سے ثابت ہے کہ وہ قبل از محشر جنت میں داخل ہوتی ہیں۔"
  },
  {
    "id": "27",
    "text": "بِمَا غَفَرَ لِي رَبِّي وَجَعَلَنِي مِنَ الْمُكْرَمِينَ",
    "translate": "کہ میرے رب نے مجھے بخش دیا اور مجھے عزت والوں میں کر دیا ف6",
    "tafsir": "ف6 قوم نے اس کی دشمنی کی کہ مار ڈالا۔ اس کو بہشت میں پہنچ کر بھی قوم کی خیر خواہی کا خیال رہا کہ اگر میرا حال اور جو انعام و اکرام حق تعالی نے مجھ پر کیا ہے معلوم کرلیں تو سب ایمان لے آئیں۔"
  },
  {
    "id": "28",
    "text": "وَمَا أَنْزَلْنَا عَلَىٰ قَوْمِهِ مِنْ بَعْدِهِ مِنْ جُنْدٍ مِنَ السَّمَاءِ وَمَا كُنَّا مُنْزِلِينَ",
    "translate": "اور ہم نے اس کی قوم پر اس کے بعد کوئی فوج آسمان سے نہ اتاری اور نہ ہم اتارنے والے تھے",
    "tafsir": ""
  },
  {
    "id": "29",
    "text": "إِنْ كَانَتْ إِلَّا صَيْحَةً وَاحِدَةً فَإِذَا هُمْ خَامِدُونَ",
    "translate": "صرف ایک ہی چیخ تھی کہ جس سے وہ بجھ کر رہ گئے ف7",
    "tafsir": "ف7 یعنی اس کے بعد اس کی قوم کٹر و ظلم اور تکذیب مسلمین کی پاداش میں بلاک کی گئی اور اس املاک کے لیے کوئی مزید اہتمام کرنا نہیں پڑا کہ آسمان سے فرشتوں کی فوج بھیجی جاتی، نہ حق تعالی کی یہ عادت ہے کہ قوموں کی ہلاکت کے لیے بڑی بڑی فوجیں بھیجا کریں ( یوں کسی خاص موقع پر کسی خاص مصلحت کی وجہ سے فرشتوں کا لشکر بھیج دیں وہ دوسری بات ہے وہاں تو بڑے بڑے مدعیوں کو ٹھنڈا کرنے کے لیے ایک ڈانٹ کافی ہے۔ چنانچہ اس قوم کا حال بھی یہ ہی ہوا کہ فرشتوں نے ایک چیخ ماری اور سب کے سب اسی دم بجھ کر رہ گئے۔"
  },
  {
    "id": "30",
    "text": "يَا حَسْرَةً عَلَى الْعِبَادِ ۚ مَا يَأْتِيهِمْ مِنْ رَسُولٍ إِلَّا كَانُوا بِهِ يَسْتَهْزِئُونَ",
    "translate": "کیا افسوس ہے بندوں پر ان کے پاس ایساکوئی بھی رسول نہیں آیا جس سے انہوں نے ہنسی نہ کی ہو",
    "tafsir": ""
  },
  {
    "id": "31",
    "text": "أَلَمْ يَرَوْا كَمْ أَهْلَكْنَا قَبْلَهُمْ مِنَ الْقُرُونِ أَنَّهُمْ إِلَيْهِمْ لَا يَرْجِعُونَ",
    "translate": "کیا یہ نہیں دیکھ چکے کہ ہم نے ان سے پہلے کتنی قوموں کو ہلاک کر دیا وہ ان کے پاس لوٹ کر نہیں آئے ف8",
    "tafsir": "ف8 یعنی دیکھتے اور سنتے ہیں کہ دنیا میں کتنی قومیں پہلے پیغمبروں سے ٹھٹھا کر کے غارت ہو چکی ہیں جن کا نام و نشان مٹ چکا۔ کوئی ان میں سے لوٹ کر ادھر واپس نہیں آئی۔ عذاب کی چکی میں سب پس کر برابر ہو گئیں اس پر بھی عبرت نہیں ہوئی، جب کوئی نیا رسول آتا ہے وہ ہی تمسخر اور استہزاء مشروع کر دیتے ہیں۔ جو پہلے کفار کی عادت تھی۔ چنانچہ آج خاتم الانبیاء صلی اللہ علیہ وسلم کے ساتھ کفار مکہ کا یہ ہی معاملہ ہے۔"
  },
  {
    "id": "32",
    "text": "وَإِنْ كُلٌّ لَمَّا جَمِيعٌ لَدَيْنَا مُحْضَرُونَ",
    "translate": "اور سب کے سب ہمارے پاس حاضر ہیں ف9",
    "tafsir": "ف9 یعنی وہ تو دنیا کا عذاب تھا، اور آخرت کی معزا الگ رہی۔ سم رہی۔ یہ نہ سمجھو کہ ہلاک ہو کر ادھر واپس نہیں آتے تو بس قصہ ختم ہوا۔ نہیں، سب کو پھر ایک دن خدا کے ہاں حاضر ہوتا ہے۔ جہاں بلا استثناء مجرم پکڑے ہوئے"
  },
  {
    "id": "33",
    "text": "وَآيَةٌ لَهُمُ الْأَرْضُ الْمَيْتَةُ أَحْيَيْنَاهَا وَأَخْرَجْنَا مِنْهَا حَبًّا فَمِنْهُ يَأْكُلُونَ",
    "translate": "اور ان کے لیے خشک زمین بھی ایک نشانی ہے جسے ہم نے زندہ کیا اور اس سے اناج نکالا جس سے وہ کھاتے ہیں",
    "tafsir": ""
  },
  {
    "id": "34",
    "text": "وَجَعَلْنَا فِيهَا جَنَّاتٍ مِنْ نَخِيلٍ وَأَعْنَابٍ وَفَجَّرْنَا فِيهَا مِنَ الْعُيُونِ",
    "translate": "اور اس میں ہم نے کھجوروں اور انگوروں کے باغ بنائے اور ان میں چشمے جاری کیے",
    "tafsir": ""
  },
  {
    "id": "35",
    "text": "لِيَأْكُلُوا مِنْ ثَمَرِهِ وَمَا عَمِلَتْهُ أَيْدِيهِمْ ۖ أَفَلَا يَشْكُرُونَ",
    "translate": "تاکہ وہ اس کے پھل کھائیں ف1 اور یہ چیزیں ان کے ہاتھوں کی بنائی ہوئی نہیں ہیں پھر کیوں شکر نہیں کرتے ف2",
    "tafsir": "ف1 یعنی شاید شهر گز تا کہ میرے پیچھے پھر کس طرح زندہ ہو کر حاضر کیے جائیں گے؟ اس کو یوں سمجھا دیا کہ زمین خشک اور مردہ پڑی ہوتی ہے۔ پھر خدا اس کو زندہ کرتا ہے کہ ایک دم مسلمانے لگتی ہے۔ کیسے کیسے باغ و بہار ملے اور میوے اس سے پیدا ہوتے ہیں جن کو تم استعمال میں لاتے ہو۔ اسی طرح خیال کر لو کہ مردہ ابدان میں روح حیات پھونک دی جائے گی۔ بہر حال مردہ زمیر کے لیے ایک نشانی ہے جس میں غور کرنے سے بعث بعد الموت اور حق تعالی کی وحدانیت و عظمت اور اس ۔ و احسان کے مسائل کو بخوبی سمجھ سکتے ہیں ( تنبیہ) اوپر کی آیات میں ترہیب کا پہلو نمایاں تھا کہ عذاب الہی سے ڈر کر راہ ہدایت اختیار کریں۔ آیات حاضرہ میں ترغیب کی صورت اختیار فرمائی ہے۔ یعنی اللہ تعالی کی نعمتوں کو پہچان کر شکر گزاری کی طرف متوجہ ہوں اور یہ بھی سمجھیں کہ جو خدا مردہ زمین کو زندہ کرتا ہے وہ ایمانی حیثیت سے ایک مردہ قوم کو زندہ کر دے، یہ کیا مشکل ہے۔\nف2 یعنی یہ پھل اور میوے قدرت الہی سے پیدا ہوتے ہیں، ان کے ہاتھوں میں یہ طاقت نہیں کہ ایک انگور یا کھجور کا دانہ پیدا کرلیں۔ جو محنت اور تردد باغ لگانے اور اس کی پرورش کرنے میں کیا جاتا ہے اس کو بار آور کرنا صرف اللہ تعالی کے قبضہ قدرت میں ہے اور غور سے دیکھا جائے تو جو کام بظاہر ان کے ماتھوں سے ہوتا ہے وہ بھی فی الحقیقت حق تعالی کی عطا کی ہوئی قدرت و طاقت اور اس کی مثبت و ارادہ سے ہوتا ہے لہذا مہر حیثیت سے اس کی شکر گزاری اور احسان شناسی واجب ہوئی۔ (تنبیہ) معتز حجم محقق رحمہ اللہ نے \"وما عملتہ ایدیم \"میں \"\" کو نافہ لیا ہے۔ کما ہو داب اکثر المتاخرین۔ لیکن سلف سے عموماً \"،\" کا موصلہ ہونا منقول ہے اور اسی کی تائید ا بن مسعود کی قرآت \"ومما عملتہ ایدیم\" سے ہوتی ہے۔"
  },
  {
    "id": "36",
    "text": "سُبْحَانَ الَّذِي خَلَقَ الْأَزْوَاجَ كُلَّهَا مِمَّا تُنْبِتُ الْأَرْضُ وَمِنْ أَنْفُسِهِمْ وَمِمَّا لَا يَعْلَمُونَ",
    "translate": "وہ ذات پاک ہے جس نے زمین سے اگنے والی چیزوں کوگوناگوں بنایا اور خود ان میں سے بھی اور ان چیزوں میں سے بھی جنہیں وہ نہیں جانتے ف3",
    "tafsir": "ف3 یعنی نباتات میں، انسانوں میں اور دوسری مخلوقات میں جن کی انہیں پوری خبر بھی نہیں۔ اللہ تعالی نے جوڑے بنائے ہیں خواہ تقابل کی حیثیت سے جیسے عورت مرد، نر مادہ، کھٹا میٹھا، سیاه سفید، دن رات، اندھیرا اجالا، یا تماثل کی حیثیت سے جیسے یکساں رنگ اور مزے کے پھل اور ایک شکل و صورت کے دو جانور، بہر حال مخلوقات میں کوئی مخلوق نہیں جس کا مماثل یا مقابل نہ ہو یہ صرف خدا ہی کی ذات پاک ہے جس کا نہ کوئی مقابل ہے نہ مماثل، کیونکہ مقابلہ یا مماثلت ان چیزوں میں ہو سکتی ہے جو کسی درجہ میں فی الجملہ اشتراک رکھتی ہوں۔ خالق و مخلوق کا کسی حقیقت میں اشتراک ہی نہیں۔"
  },
  {
    "id": "37",
    "text": "وَآيَةٌ لَهُمُ اللَّيْلُ نَسْلَخُ مِنْهُ النَّهَارَ فَإِذَا هُمْ مُظْلِمُونَ",
    "translate": "اور ان کے لیے رات بھی ایک نشانی ہے کہ ہم اس کے اوپرسے دن کو اتار دیتے ہیں پھر ناگہاں وہ اندھیرے میں رہ جاتے ہیں ف4",
    "tafsir": "ف4 \"سلخ \"کھتے ہیں جانور کی کھال اتارنے کو جس سے نیچے کا گوشت ظاہر ہو جائے۔ اسی طرح سمجھ لو رات کی تاریکی پر دن کی چادر پڑی ہوئی ہے۔ جس وقت یہ نور کی چادر اوپر سے اتار لی جاتی ہے لوگ اندھیرے میں پڑے رہ جاتے ہیں اس کے بعد پھر سورج اپنی مقررہ رفتار سے معین وقت پر آکر سب جگہ اجالا کرتا ہے۔ لیل و نہار کے ان تقلبات پر قیاس کر کے سمجھ لو کہ اسی طرح اللہ تعالی عالم کو فنا کر کے دوبارہ زندہ کر سکتا ہے اور بیشک وہ ہی ایک عدا لائق پرستش ہے جس کے ہاتھ میں ان عظیم الشان انقلابات کی باگ ہے۔ جن سے ہم کو مختلف قسم کے فوائد پہنچتے ہیں۔ نیز جو قادر مطلق رات کو دن سے تبدیل کرتا ہے کیا کچھ بعید ہے کہ بذریعہ آفتاب رسالت کے دنیا سے جہالت کی تاریکیوں کو دور کر دے لیکن رات دن اور چاند، سورج کے طلوع و غروب کی طرح ہر کام اپنے وقت پر ہوتا ہے۔"
  },
  {
    "id": "38",
    "text": "وَالشَّمْسُ تَجْرِي لِمُسْتَقَرٍّ لَهَا ۚ ذَٰلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ",
    "translate": "اور سورج اپنے ٹھکانے کی طرف چلتا رہتا ہے یہ زبردست خبردار کا اندازہ کیا ہوا ہے ف5",
    "tafsir": " ف5 سورج کی چال اور راستہ مقرر ہے اسی پر چلا جاتا ہے۔ ایک انچ یا ایک منٹ اس سے ادھر ادھر نہیں ہو سکتا۔ جس کام پر لگا دیا ہے ہر وقت اس میں مشغول ہے۔ کسی دم قرار نہیں۔ رات دن کی گردش اور سال بھر کے چکر میں جس جس نڑکانہ پر اسے پہنچنا ہے پہنچتا ہے۔ پھر وہاں سے باذن خداوندی نیا دورہ شروع کرتا ہے۔ قرب قیامت تک اسی طرح کرتا رہے گا۔ تاآنکہ ایک وقت آئے گا جب اس کو حکم ہو گا کہ جدھر سے غروب ہوا ہے ادھر سے واپس آئے یہی وقت ہے جب باب تو بہ بند کر دیا جائے گا۔ کما ورد في الحديث الصحیح۔ بات یہ ہے کہ اس کے طلوع و غریب کا یہ سب نظام اس زبردست اور باخبر ہستی کا قائم کیا ہوا ہے جس کے انتظام کو کوئی دوسرا شکست نہیں کر سکتا، اور نہ اس کی حکمت و دانائی پر کوئی حرف گیری کر سکتا ہے وہ خود جب چاہے اور جس طرح چاہے الٹ پلٹ کرے کسی کو مجال انکار نہیں ہو سکتی۔ (تنبیہ) اس آیت کی تفسیر میں ایک حدیث آئی ہے جس میں شمس کے تحت العرش سجدہ کرنے کا ذکر ہے۔ یہاں اس کی تشریح کا موقع نہیں۔ اس پر ہمارا مستقل مضمون \"سجود الشمس\" کے نام سے چھپا ہوا ہے۔ ملاحظہ کر لیا جائے۔"
  },
  {
    "id": "39",
    "text": "وَالْقَمَرَ قَدَّرْنَاهُ مَنَازِلَ حَتَّىٰ عَادَ كَالْعُرْجُونِ الْقَدِيمِ",
    "translate": "اور ہم نے چاند کی منزلیں مقرر کر دی ہیں یہاں تک کہ پرانی ٹہنی کی طرح ہوجاتا ہے ف6",
    "tafsir": "ف6 سورج کی طرح چاند ہمیشہ ایک طرح نہیں رہتا بلکہ روزانہ گھٹتا بڑھتا۔ اس کی اٹھائیس منزلیں اللہ نے مقرر کر دی ہیں۔ ان کو ایک معین نظام کے ساتھ درجہ بدرجہ ملے کرتا ہے۔ پہلی آیت میں رات دن کا بیان تھا، پھر سورج کا ذکر کیا جس سے سالوں اور فصلوں کی تشکیل ہوتی ہے۔ اب چاند کا تذکرہ کرتے ہیں جس کی رفتار سے قمری مہینوں کا وجود وابستہ ہے۔ چاند سورج مہینہ کے آخر میں ملتے ہیں تو چاند چھپ جاتا ہے جب آگے بڑھتا ہے تو نظر آتا ہے۔ پھر معزل بہ منزل بڑھتا چلا جاتا اور چودھویں شب کو پورا ہو کر بعد میں گھٹنا شروع ہوتا ہے آخر رفتہ رفتہ اسی پہلی حالت پر آپنپتا اور کھمبور کی پرانی ٹہنی کی طرح پتلا، خمدار اور بے رونق سا ہو کر رہ جاتا ہے۔"
  },
  {
    "id": "40",
    "text": "لَا الشَّمْسُ يَنْبَغِي لَهَا أَنْ تُدْرِكَ الْقَمَرَ وَلَا اللَّيْلُ سَابِقُ النَّهَارِ ۚ وَكُلٌّ فِي فَلَكٍ يَسْبَحُونَ",
    "translate": "نہ سورج کی مجال ہے ہ چاند کو جا پکڑے اور نہ رات ہی دن سے پہلے آ سکتی ہے اور ہر ایک ایک آسمان میں تیرتا پھرتا ہے ف7",
    "tafsir": "ف7 سورج کی سلطنت دن میں ہے اور چاند کی رات میں، یہ نہیں ہو سکتا کہ چاند کی نور افشانی کے وقت سورج اس کو آدبائے۔ یعنی دن آگے بڑھ کر رات کا کچھ حصہ اڑا لے یا رات سہنت کر کے دن کے ختم ہونے سے پہلے آجائے۔ جس زمانہ اور جس ملک میں جو اندازہ رات، دن کا رکھ دیا ہے ان کی رات کی مجال نہیں کہ ایک منٹ آگے پیچھے ہو سکیں۔ ہر ایک سیارہ اپنے اپنے مدار میں پڑ چکر کھا رہا ہے اس سے ایک قدم ادھر ادھر نہیں ہٹ سکتا اور باوجود اس قدر سریع حرکت اور کھلی ہوئی فضا کے نہ ایک دوسرے سے ٹکراتا ہے نہ مقررہ انداز سے زیادہ تیز یا ست ہوتا ہے کیا یہ اس کا واضح نشان نہیں کہ یہ سب عظیم الشان مشینیں اور ان کے تمام پرزے کسی ایک زبردست مدبر و دانا ہستی کے قبضہ اقتدار میں اپنا اپنا کام کر رہے ہیں۔ پھر جو ہستی رات دن اور چاند سورج کا ادل بدل کرتی ہے وہ تمہارے فنا کرنے اور فنا کے بعد دوبارہ پیدا کرنے سے عاجز ہو گی؟ (العیاذ باللہ) (تنهبی) حضرت شاہ صاحب \"لا الشمس ینسفی اها ان تدرک القمر \" کی تعبیر کا نکتہ بیان فرماتے ہیں کہ سورج چاند اخیر مہینہ میں ملتے ہیں تو چاند پکڑتا ہے سورج کو۔ سورج چاند کو نہیں پکڑتا۔\" اسی لیے لا القمر ينبغي له ان يدرك الشمس نہیں فرمایا ۔ واللہ اعلم ۔"
  },
  {
    "id": "41",
    "text": "وَآيَةٌ لَهُمْ أَنَّا حَمَلْنَا ذُرِّيَّتَهُمْ فِي الْفُلْكِ الْمَشْحُونِ",
    "translate": "اور ان کے لیے یہ بھی نشانی ہے ہم نے ان کی نسل کوبھری کشتی میں سوار کیا",
    "tafsir": ""
  },
  {
    "id": "42",
    "text": "وَخَلَقْنَا لَهُمْ مِنْ مِثْلِهِ مَا يَرْكَبُونَ",
    "translate": "اور ان کے لیے اسی طرح کی اور بھی چیزیں بنائی ہیں جن پر وہ سوار ہوتے ہیں ف8",
    "tafsir": "ف 8 یعنی حضرت نوح کے زمانہ میں جب طوفان آیا تو آدم کی نسل کو اس بھری ہوئی کشتی پر سوار کرلیا جو حضرت نون نے بنائی تھی۔ اور نہ انسان کا تخم باقی نہ رہتا۔ پھر اسی کشتی کے نمونہ کی دوسری کشتیاں اور جہاز تمہارے لیے بنا دیے جن پر تم آج تک لدے پھرتے ہو۔ یا کشتیوں جیسی دوسری سواریاں پیدا کر دیں جس پر سوار ہوتے ہو۔ مثلاً اونٹ، جن کو عرب \"سفائن البر \" (خشکی کی کشتیاں) کہا کرتے تھے۔"
  },
  {
    "id": "43",
    "text": "وَإِنْ نَشَأْ نُغْرِقْهُمْ فَلَا صَرِيخَ لَهُمْ وَلَا هُمْ يُنْقَذُونَ",
    "translate": "اور اگر ہم چاہتے تو انہیں ڈبو دیتے پھر نہ ان کا کوئی فریاد رس ہوتا اور نہ وہ بچائے جاتے",
    "tafsir": ""
  },
  {
    "id": "44",
    "text": "إِلَّا رَحْمَةً مِنَّا وَمَتَاعًا إِلَىٰ حِينٍ",
    "translate": "مگر یہ ہماری مہربانی ہے اور انہیں ایک مدت تک فائدہ دینا ہے ف9",
    "tafsir": "ف9 یعنی یه مشت استخوان انسان! دیکھو کیسے خوفناک سمندروں کو کشتی کے ذریعہ عبور کرتا ہے۔ جہاں بڑے بڑے جہازوں کی حقیقت ایک تنکے کے برابر نہیں۔ اگر اللہ اس وقت غرق کرنا چاہے تو کون بچا سکتا ہے اور کون ہے جو فریاد کو پہنچے۔ مگر یہ اس کی مہربانی اور مصلحت ہے کہ اس طرح سب بحری سواریوں کو غرق نہیں کر دیتا۔ کیونکہ اس کی رحمت و حکمت متمنی ہے کہ ایک معین وقت تک دنیا کا کام چلتا رہے۔ افسوس ہے کہ بہت لوگ ان نشانیوں کو نہیں سمجھتے نہ اس کی نعمتوں کو قدر کرتے ہیں۔"
  },
  {
    "id": "45",
    "text": "وَإِذَا قِيلَ لَهُمُ اتَّقُوا مَا بَيْنَ أَيْدِيكُمْ وَمَا خَلْفَكُمْ لَعَلَّكُمْ تُرْحَمُونَ",
    "translate": "اور جب ان سے کہا جاتا ہے کہ اپنے سامنے اور پیچھے آنے والے عذاب سے ڈرو تاکہ تم پر رحم کیا جائے",
    "tafsir": ""
  },
  {
    "id": "46",
    "text": "وَمَا تَأْتِيهِمْ مِنْ آيَةٍ مِنْ آيَاتِ رَبِّهِمْ إِلَّا كَانُوا عَنْهَا مُعْرِضِينَ",
    "translate": "اوران کے پاس ان کے رب کی نشانیوں میں سے ایسی کوئی بھی نشانی نہیں آتی جس سے وہ منہ موڑ لیتے ہوں ف1",
    "tafsir": "ف1 سامنے آتا ہے جزاء کا دن اور پیچھے چوڑے اپنے اعمال یعنی جب کہا جاتا ہے کہ قیامت کی سزا اور بداعمالیوں کی شامت سے پہنے کی فکر کرو تا کہ خدا کی رحمت تمہاری طرف متوجہ ہو تو نصیحت پر ذرا کان نہیں دھرتے۔ ہمیشہ خدائی احکام سے رو گردانی کرتے رہتے ہیں۔"
  },
  {
    "id": "47",
    "text": "وَإِذَا قِيلَ لَهُمْ أَنْفِقُوا مِمَّا رَزَقَكُمُ اللَّهُ قَالَ الَّذِينَ كَفَرُوا لِلَّذِينَ آمَنُوا أَنُطْعِمُ مَنْ لَوْ يَشَاءُ اللَّهُ أَطْعَمَهُ إِنْ أَنْتُمْ إِلَّا فِي ضَلَالٍ مُبِينٍ",
    "translate": "اور جب ان سے کہا جاتا ہےکہ الله کے رزق میں سے کچھ خرچ کیا کرو تو کافر ایمانداروں سے کہتے ہیں کیا ہم اسے کھلائیں گےکہ اگر الله چاہتا تو خود اسے کھلا ف2 سکتا تھا تم جو ہو تو صاف گمراہی میں پڑے ہوئے ہو ف3",
    "tafsir": "ف2 یعنی اور احکام ابھی تو کیا مانتے، فقیروں مسکینوں پر خرچ کرنا تو ان کے نزدیک بھی کار ثواب ہے لیکن یہ ہی مسلم بات جب پیغمبر اور مومنین کی طرف سے بھی باقی ہے تو نہایت بھونڈے طریقہ سے تمسخر کے ساتھ یہ کہہ کر اس کا انکار کر دیتے ہیں کہ جنہیں خود اللہ میاں نے کھانے کو نہیں دیا تم انہیں کیوں کھلائیں۔ ہم تو اللہ کی مشیت کے خلاف کرنا نہیں چاہتے اگر اس کی مشیت ہوتی تو ان کو فقیر و محتاج اور ہمیں غنی و تونگر نہ بناتا۔ خیال کرو اس حماقت اور بے حیائی کا کیا ٹھکانہ ہے۔ کیا عدا کسی کو دینا چاہے تو اس کی یہ ہی ایک صورت ہے کہ خود بلا واسطہ رزق اس کے ہاتھ پر رکھ دے۔ اگر وسائط سے دلانا بھی اس کی مشیت سے ہے تو تم نے یہ فیصلہ کیسے کرلیا کہ اللہ ان کو روٹی دینا نہیں چاہتا۔ یہ تو اس کا امتحان ہے کہ اغنیا کو فقراء کی اعانت پر مامور فرمایا اور ان کے توسط سے رزق پہنچانے کا سمان کیا جو اس امتحان میں نا کامیاب رہا اسے اپنی بد بختی اور شقاوت پر رونا چاہیے۔ (تنبیہ) بعض سلت کے اقوال سے معلوم ہوتا ہے کہ یہ آیات بعض زنادقہ کے حق میں ہیں۔ اس صورت میں ان کے اس قول کو تمسخر پر حمل نہ کیا جائے گا بلکہ حقیقت پر رکھینگے۔ ف 3 اگر یہ جملہ کفار کے قول کا تشمہ ہے تو مطلب یہ ہوگا کہ اے گروہ مومنین! تم صریح گمراہی میں پڑے ہو۔ ایسے لوگوں کا پیٹ بھر نا چاہتے ہو جن کا خدا بپیٹ بھرنا نہیں چاہتا۔ لیکن ظاہر یہ ہے کہ یہ حق تعالی کی طرف سے ان کفار کو خطاب ہے کہ کس قدر بہکی بہکی باتیں کرتے ہیں۔ حضرت شاہ صاحب لکھتے ہیں۔ \"یہ گمراہی ہے نیک کام میں تقریر کے حوالے کرنا اور اپنے مزے میں اللچ پر دوڑ نا۔\""
  },
  {
    "id": "48",
    "text": "وَيَقُولُونَ مَتَىٰ هَـٰذَا الْوَعْدُ إِنْ كُنْتُمْ صَادِقِينَ",
    "translate": "اور کہتے ہیں یہ وعدہ کب ہوگا اگر تم سچے ہو ف4",
    "tafsir": "ف4 یعنی به قیامت اور عذاب کی دھمکیاں کب پوری ہوں گی۔ اگر سچے ہو تو جلد پوری کر کے دکھلا دو۔"
  },
  {
    "id": "49",
    "text": "مَا يَنْظُرُونَ إِلَّا صَيْحَةً وَاحِدَةً تَأْخُذُهُمْ وَهُمْ يَخِصِّمُونَ",
    "translate": "وہ صرف ایک چیخ ہی کا انتظار کر رہے ہیں جو انہیں آ لے گی اور وہ آپس میں جھگڑ رہے ہوں گے",
    "tafsir": ""
  },
  {
    "id": "50",
    "text": "فَلَا يَسْتَطِيعُونَ تَوْصِيَةً وَلَا إِلَىٰ أَهْلِهِمْ يَرْجِعُونَ",
    "translate": "پس نہ تو وہ وصیت کر سکیں گے اور نہ اپنے گھر والوں کی طرف واپس جا سکیں گے ف5",
    "tafsir": "ف5 یعنی قیامت ناگہاں آپکڑے گی اور وہ اپنے معاملات میں غرق ہوں گے۔ جس وقت پہلا صور پھونکا جائے گا سب ہوش و حواس جاتے رہیں گے اور آخر مر کر ڈھیر ہو جائیں گے۔ اتنی فرصت بھی نہ ملے گی کہ فرض کرو مرنے سے پہلے کسی کو کچھ کہنا چاہیں تو کہہ گزریں یا جو گھر سے باہر ۔ تھے وہ گھر واپس جاسکیں۔"
  },
  {
    "id": "51",
    "text": "وَنُفِخَ فِي الصُّورِ فَإِذَا هُمْ مِنَ الْأَجْدَاثِ إِلَىٰ رَبِّهِمْ يَنْسِلُونَ",
    "translate": "اور صور پھونکا جائے گا تو وہ فوراً اپنی قبروں سے نکل کر اپنے رب کی طرف دوڑے چلے آئیں گے ف6",
    "tafsir": "ف6 یعنی دوسری مرتبہ صور پھونکا جائے گا تو سب زندہ ہو کر اپنی قبروں سے اٹھ کھڑے ہوں گے اور فرشتے ان کو جلد جلد دھکیل کر میدان حشر میں لے جائیں گے۔"
  },
  {
    "id": "52",
    "text": "قَالُوا يَا وَيْلَنَا مَنْ بَعَثَنَا مِنْ مَرْقَدِنَا ۜ ۗ هَـٰذَا مَا وَعَدَ الرَّحْمَـٰنُ وَصَدَقَ الْمُرْسَلُونَ",
    "translate": "کہیں گے ہائے افسوس کس نے ہمیں ہماری خوابگاہ سے اٹھایا ف7 یہی ہے جو رحمان نے وعدہ کیا تھا اور رسولوں نے سچ کہا تھا ف8",
    "tafsir": "ف7 شاید نفخہ اولی اور نفخہ ثانیہ کے درمیان ان پر نیند کی حالت طاری کر دی جائے۔ یا قیامت کا ہولناک منظر دیکھ کر عذاب قبر کو اہون سمجھیں گے اور نیند سے تشبیہ دیں گے۔ یا \"مرقد\" بمعنی \"منیج\" کے ہو۔ نیند کی کیفیت سے تجرید کرلی جائے۔ واللہ اعلم ۔ ف8 یہ جواب اللہ کی طرف سے اس وقت ملے گا یا مستقبل کو حاضر قرار دے کر اب جواب دے رہے ہیں۔ یعنی کیا پوچھتے ہو کس نے اٹھا دیا۔ ذرا آنکھیں کھولو۔ یہ وہ ہی اٹھانا ہے جس کا وعدہ خدائے رحمان کی طرف سے کیا گیا تھا اور پیغمبر جس کی خبر برابر دیتے رہے تھے۔"
  },
  {
    "id": "53",
    "text": "إِنْ كَانَتْ إِلَّا صَيْحَةً وَاحِدَةً فَإِذَا هُمْ جَمِيعٌ لَدَيْنَا مُحْضَرُونَ",
    "translate": "وہ تو صرف ایک ہی زور کی آواز ہو گی پھر وہ سب ہمارے سامنے حاضر کیے جائیں گے ف9",
    "tafsir": " ف9 یعنی کوئی متنفس نہ بھاگ سکے گا نہ روپوش ہو سکے گا۔"
  },
  {
    "id": "54",
    "text": "فَالْيَوْمَ لَا تُظْلَمُ نَفْسٌ شَيْئًا وَلَا تُجْزَوْنَ إِلَّا مَا كُنْتُمْ تَعْمَلُونَ",
    "translate": "پھر اس دن کسی پرکچھ بھی ظلم نہ کیا جائے گا اورتم اسی کا بدلہ پاؤ گے جو کیا کرتے تھے ف10",
    "tafsir": "ف10 عنی نہ کسی کی نیکی ضائع ہو گی نہ جرم کی حیثیت سے زیادہ سزا ملے گی۔ ٹھیک ٹھیک انصاف ہو گا اور جو نیک و بد کرتے تھے فی الحقیقت عذاب و ثواب کی صورت میں وہ ہی سامنے آجائے گا۔"
  },
  {
    "id": "55",
    "text": "إِنَّ أَصْحَابَ الْجَنَّةِ الْيَوْمَ فِي شُغُلٍ فَاكِهُونَ",
    "translate": "بے شک بہشتی اس دن مزہ سے دل بہلا رہے ہوں گے",
    "tafsir": ""
  },
  {
    "id": "56",
    "text": "هُمْ وَأَزْوَاجُهُمْ فِي ظِلَالٍ عَلَى الْأَرَائِكِ مُتَّكِئُونَ",
    "translate": "وہ اوران کی بیویاں سایوں میں تختوں پر تکیہ لگائے ہوئے بیٹھے ہوں گے",
    "tafsir": ""
  },
  {
    "id": "57",
    "text": "لَهُمْ فِيهَا فَاكِهَةٌ وَلَهُمْ مَا يَدَّعُونَ",
    "translate": "ان کے لیے وہاں میوہ ہوگا اور انہیں ملے گا جو وہ مانگیں گے ف1",
    "tafsir": "ف1 بہشت میں ہر قسم کے عیش و نشاط کا سامان ہو گا۔ دنیا کی کرومات سے چھوٹ کر آج یہ ہی ان کا مشغلہ ہو گا۔ وہ اور ان کی عورتیں آپس میں گھل مل کر اعلی درجہ کے خوشگوار سایوں میں مسہریوں پر آرام کر رہے ہوں گے۔ ہمہ قسم کے میوے اور پھل وغیرہ ان کے لیے حاضر ہوں گے۔ بس خلاصہ یہ ہے کہ جس چیز کی جنڈیوں کے دل میں طلب اور تمنا ہو گی وہ ہی دی جائے گی، اور منہ مانگی مرادیں ملیں گی۔ یہ تو جسمانی لذائذ کا حال ہوا، آگے روحانی نعمتوں کی طرف \"سلام قولا من رب رحیمہ\" سے اک ذرا سا اشارہ فرماتے ہیں۔"
  },
  {
    "id": "58",
    "text": "سَلَامٌ قَوْلًا مِنْ رَبٍّ رَحِيمٍ",
    "translate": "پروردگار نہایت رحم والے کی طرف سے انہیں سلام فرمایا جاوے گا ف2",
    "tafsir": "ف2 یعنی اس مهربان پروردگار کی طرف سے جنتیوں کو سلام بولا جائے گا خواہ فرشتوں کے ذریعہ سے یا جیسا کہ ابن ماجہ کی ایک روایت میں ہے بلواسطہ خود رب کریم سلام ارشاد فرمائیں گے اس وقت کی عزت و لذت کا کیا مجھنا۔ اللهم ارقنا عذه النعمة العظمی بحرمته نیک محمد صلی اللہ علیہ وسلم ۔"
  },
  {
    "id": "59",
    "text": "وَامْتَازُوا الْيَوْمَ أَيُّهَا الْمُجْرِمُونَ",
    "translate": "اے مجرمو! آج الگ ہو جاؤ ف3",
    "tafsir": "ف3 یعنی جنتیوں کے عیش و آرام میں تمہارا کوئی حصہ نہیں۔ تمہارا مقام دوسرا ہے جہاں رہنا ہو گا۔"
  },
  {
    "id": "60",
    "text": "أَلَمْ أَعْهَدْ إِلَيْكُمْ يَا بَنِي آدَمَ أَنْ لَا تَعْبُدُوا الشَّيْطَانَ ۖ إِنَّهُ لَكُمْ عَدُوٌّ مُبِينٌ",
    "translate": "اے آدم کی اولاد! کیا میں نے تمہیں تاکید نہ کر دی تھی کہ شیطان کی عبادت نہ کرنا کیونکہ وہ تمہارا صریح دشمن ہے",
    "tafsir": ""
  },
  {
    "id": "61",
    "text": "وَأَنِ اعْبُدُونِي ۚ هَـٰذَا صِرَاطٌ مُسْتَقِيمٌ",
    "translate": "اور یہ کہ میری ہی عبادت کرنا یہ سیدھا راستہ ہے ف4",
    "tafsir": "ف4 یعنی اسی دن کے لیے تم کو انبیاء علیہم السلام کی زبانی بار بار سمجھایا گیا کہ شیطان لعین کی پیروی مت کرنا جو تمہارا صریح دشمن ہے وہ جہنم میں پہنچائے بغیر نہ چھوڑے گا۔ اگر ابدی نجات چاہتے ہو تو یہ سیدھی راہ پڑی ہوئی ہے اس پر پہلے آؤ اور اکیلے ایک خدا کی پرستش کرو۔"
  },
  {
    "id": "62",
    "text": "وَلَقَدْ أَضَلَّ مِنْكُمْ جِبِلًّا كَثِيرًا ۖ أَفَلَمْ تَكُونُوا تَعْقِلُونَ",
    "translate": "اور البتہ اس نے تم میں سے بہت لوگوں کو گمراہ کیا تھا کیا پس تم نہیں سمجھتے تھے",
    "tafsir": ""
  },
  {
    "id": "63",
    "text": "هَـٰذِهِ جَهَنَّمُ الَّتِي كُنْتُمْ تُوعَدُونَ",
    "translate": "یہی دوزخ ہے جس کا تم سے وعدہ کیا جاتا تھا",
    "tafsir": ""
  },
  {
    "id": "64",
    "text": "اصْلَوْهَا الْيَوْمَ بِمَا كُنْتُمْ تَكْفُرُونَ",
    "translate": "آج اس میں داخل ہو جاؤ اس کے بدلے جوتم کفر کیا کرتے تھے ف5",
    "tafsir": "ف5 یعنی افسوس اتنی نصیحت و فہمائش پر بھی تم کو عقل نہ آئی اور ملعون نے ایک خلافت کو گمراہ کر چھوڑا کیا تمہیں اتنی سمجھ نہ تھی کہ دوست دشمن میں تمیز کر سکتے۔ اور اپنے نفع و نقصان کو پہچانتے۔ دنیا کے کاموں میں تو اس قدر ہوشیاری اور ذمانت دکھلاتے تھے مگر آخرت کے معاملہ میں اتنے عنبی بن گئے کہ موٹی موٹی باتوں کے سمجھنے کی لیاقت نہ رہی۔ اب اپنی حماقتوں کا خمیازہ ؟ ھگتو۔ یہ دوزخ تیار ہے جس کا بصورت کفر اختیار کرنے کے تم سے وعدہ کیا گیا تھا۔ کفر کا ٹکا نہ یہ ہی ہے۔ چاہیے کہ اپنے ٹھکانے پر پہنچ جاؤ۔"
  },
  {
    "id": "65",
    "text": "الْيَوْمَ نَخْتِمُ عَلَىٰ أَفْوَاهِهِمْ وَتُكَلِّمُنَا أَيْدِيهِمْ وَتَشْهَدُ أَرْجُلُهُمْ بِمَا كَانُوا يَكْسِبُونَ",
    "translate": "آج ہم ان کے مونہوں پر مہر لگا دیں گے اور ہمارے ساتھ ان کے ہاتھ بولیں گے اور ان کے پاؤں شہادت دیں گے اس پر جو وہ کیا کرتے تھے ف2",
    "tafsir": "ف2 یعنی آج اگر یہ لوگ اپنے حرموں کا زبان سے اعتراف نہ بھی کریں تو کیا ہوتا ہے، ہم منہ پر مہر لگا دیں گے اور ہاتھ پاؤں کان آنکھ حتی کہ بدن کی کھال کو حکم دیا جائے گا کہ ان کے ذریعہ سے جن جرائم کا ارتکاب کیا تھا بیان کریں۔ چنانچہ ہر ایک عضو اللہ کی قدرت سے گویا ہو گا اور ان حرموں کی شہادت دے گا۔ کما قال تعالی۔ \"حتى اذا ماجاؤها شهد عليهم سمعهم وابصار بهم وتجلود تم بما كانوا يعملون \"( حم السجده، رکوع ۳) وقال تعالى في موضع آخر ۔ \"قالوا انطلقنا الله الذي انطق کل شئی \" ( حم السجدہ، رکوع۳)"
  },
  {
    "id": "66",
    "text": "وَلَوْ نَشَاءُ لَطَمَسْنَا عَلَىٰ أَعْيُنِهِمْ فَاسْتَبَقُوا الصِّرَاطَ فَأَنَّىٰ يُبْصِرُونَ",
    "translate": "اور اگر ہم چاہیں تو ان کی آنکھیں مٹاڈالیں پس وہ راستہ کی طرف دوڑیں پھر وہ کیوں کر دیکھ سکیں",
    "tafsir": ""
  },
  {
    "id": "67",
    "text": "وَلَوْ نَشَاءُ لَمَسَخْنَاهُمْ عَلَىٰ مَكَانَتِهِمْ فَمَا اسْتَطَاعُوا مُضِيًّا وَلَا يَرْجِعُونَ",
    "translate": "اور اگر ہم چاہیں تو ان کی صورتیں ان جگہوں پر مسخ کر دیں پس نہ وہ آگے چل سکیں او ر نہ ہی واپس لوٹ سکیں ف7",
    "tafsir": "ف7 یعنی جیسے انہوں نے ہماری آیتوں سے آنکھیں بند کرلی ہیں اگر ہم چاہیں تو دنیا ہی میں بطور سزا کے ان کی ظاہری بینائی چھین کر نیٹ اندھا کر دیں کہ ادھر ادھر جانے کا راستہ بھی نہ سوجھے اور جس طرح یہ لوگ شیطانی راستوں سے ہٹ کر اللہ کی راہ پر چلنا نہیں چاہتے، ہم کو قدرت ہے کہ اس کی صورتیں بگاڑ کر بالکل پانچ بنا دیں کہ پھر یہ کسی ضرورت کے لیے اپنی جگہ سے ہل نہ سکیں۔ پر ہم نے ایسا نہ چاہا اور ان جوارن و قوی سے ان کو محروم نہ کیا۔ یہ ہماری طرف سے مہلت اور ڈھیل تھی آج وہ ہی آنکھیں اور ہاتھ پاؤں گواہی دیں گے کہ ان بیہودوں نے تم کو کن نالائق کاموں میں لگایا تھا۔"
  },
  {
    "id": "68",
    "text": "وَمَنْ نُعَمِّرْهُ نُنَكِّسْهُ فِي الْخَلْقِ ۖ أَفَلَا يَعْقِلُونَ",
    "translate": "اور ہم جس کی عمر زیادہ کرتے ہیں بناوٹ میں اسے الٹا گھٹاتے چلے جاتے ہیں کیا یہ لوگ نہیں سمجھتے ف8",
    "tafsir": "ف8 یعنی آنکھیں چھین لینا اور صورت بگاڑ کر پانچ بنا دینا کچھ مستبعد مت سمجھو۔ دیکھتے نہیں ؟ ایک تندرست اور مضبوط آدمی زیادہ بوڑھا ہو کر کس طرح دیکھنے، سننے اور چلنے پھرنے سے معذور کر دیا جاتا ہے۔ گویا بچپن میں جیسا کمزور ناتواں اور دوسروں کے سارے کا محتاج تھا، بڑھاپے میں پھر اسی حالت کی طرف پلٹا دیا جاتا ہے تو کیا جو خدا پیرانہ سالی کی حالت میں ان کی قوتیں سلب کر لیتا ہے، جوانی میں نہیں کر سکتا ؟"
  },
  {
    "id": "69",
    "text": "وَمَا عَلَّمْنَاهُ الشِّعْرَ وَمَا يَنْبَغِي لَهُ ۚ إِنْ هُوَ إِلَّا ذِكْرٌ وَقُرْآنٌ مُبِينٌ",
    "translate": "اور ہم نے نبی کو شعر نہیں سکھایا اور نہ یہ اس کے مناسب ہی تھا یہ تو صرف نصیحت اور واضح قرآن ہے ف1",
    "tafsir": "ف1 عنی اوپر جو کچھ بیان ہوا وہ حقائق واقعہ ہیں۔ کوئی شاعرانہ تخیلات نہیں۔ اس پیغمبر کو ہم نے قرآن دیا ہے جو نصیحتوں اور روشن تعلیمات سے معمور ہے کوئی شعر و شاعری کا دیوان نہیں دیا جس میں نرمی طبع آزمائی اور خیالی تک بندیاں ہوں، بلکہ آپ کی طبع مبارک کو فطری طور پر اس فن شاعری سے اتنا بعید رکھا گیا کہ باوجود قریش کے اس اعلی خاندان میں سے ہونے کے حبس کی معمولی لونڈیاں بھی اس وقت شعر کھنے کا طبعی سلیقہ رکھتی تھیں۔ آپ نے مدت العمر کوئی شعر نہیں بنایا۔ یوں رجز وغیرہ کے موقع پر کبھی ایک آدند مرتبہ زبان مبارک سے متنی عبارت نکل کر بے ساختہ شعر کے سانچے میں ڈھل گئی ہو وہ الگ بات ہے۔ اسے شاعری یا شعر کہنا نہیں کھتے۔ آپ خود تو شعر کیا کھتے کسی دوسرے شاعر کا شعر مصرح بھی زندگی بھر میں دو چار مرتبہ سے زائد نہیں پڑھا۔ اور پڑھتے وقت اکثر اس میں ایسا تغیر کا لہ شعر شعر نہ رہے۔ محض مطلب شاعر ادا ہو جائے۔ غرض آپ کی طبع شریف کو شاعری سے مناسبت نہیں دی گئی تھی کیونکہ یہ چیز آپ کے منصب جلیل کے لائق نہ تھی۔ آپ حقیقت کے ترجمان تھے اور آپ کی بعثت کا مقصد دنیا کو اعلی حقائق سے بدون ادنی ترین کذب و غلو کے روشناس کرنا تھا۔ ظاہر ہے کہ یہ کام ایک شاعر کا نہیں ہو سکتا۔ کیونکہ شاعریت کا حسن و کمال کذب و مبالغہ ، خیالی بلند پروازی اور ڈر سنی کلکتہ آفرینی کے سوا کچھ نہیں۔ شعر میں اگر کوئی جز محمود ہے تو اس کی تاثیر اور دلنشینی ہو سکتی ہے۔ سو یہ چیز قرآن کی نظر میں اس درجہ پر پائی جاتی ہے کہ ساری دنیا کے شاعر مل کر یہ بھی اپنے کلاموں کے مجموعہ میں پیدا نہیں کر سکتے۔ قرآن کریم کے اسلوب بادی کو دیکھتے ہوئے کہہ سکتے ہیں کہ گویا نظم کی اصل رون نکال کر نثر میں ڈال دی گئی ہے۔ شاید یہ ہی وجہ ہے کہ بڑے بڑے فصیح و عاقل دنگ ہو کر قرآن کو شعر یا سر کھنے لگے تھے۔ حالانکہ شعر و سر کو قرآن سے کیا نسبت؟ کیا شاعری اور جادو گرمی کی بنیاد پر دنیا میں کسی قومیت و روحانیت کی ایسی عظیم الشان اور لازوال عمارتیں کھڑی ہوئی ہیں جو قرآنی تعلیم کی اساس پر آج تک قائم شدہ دیکھتے ہو۔ یہ کام شاعروں کا نہیں پہیلمبروں کا ہے کہ خدا کے حکم سے مردہ قلوب کو ابدی زندگی عطا کرتے ہیں، حق تعالی نے عرب کو یہ کہنے کا موقع نہیں دیا کہ آپ پہلے سے شاعر تھے شاعری سے ترقی کر کے نبی بن بیٹھے۔"
  },
  {
    "id": "70",
    "text": "لِيُنْذِرَ مَنْ كَانَ حَيًّا وَيَحِقَّ الْقَوْلُ عَلَى الْكَافِرِينَ",
    "translate": "تاکہ جو زندہ ہے اسے ڈرائے اور کافروں پر الزام ثابت ہو جائے ف2",
    "tafsir": "ف2 یعنی زنده دل آدمی قرآن سن کر اللہ سے ڈرے اور منکروں پر حجت تمام ہو۔ حضرت شاہ صاحب لکھتے ہیں \"جس میں جان ہو یعنی نیک اثر پکڑتا ہو اس کے فائدہ کو اور منکروں پر الزام اتارنے کو۔\""
  },
  {
    "id": "71",
    "text": "أَوَلَمْ يَرَوْا أَنَّا خَلَقْنَا لَهُمْ مِمَّا عَمِلَتْ أَيْدِينَا أَنْعَامًا فَهُمْ لَهَا مَالِكُونَ",
    "translate": "کیا انہوں نے نہیں دیکھا کہ ہم نے ان کے لیے اپنے ہاتھوں سے چار پائے بنائے جن کے وہ مالک ہیں ف3",
    "tafsir": "ف3 آیات تنزیلہ کے بعد پھر آیات تکوینیہ کی طرف توجہ دلاتے ہیں۔ یعنی ایک طرف قرآن کی پندو نصیحت کو سنو، اور دوسری طرف غور سے دیکھو کہ اللہ کے کیسے کیسے انعام و احسان تم پر ہوئے ہیں، اونٹ، گائے، بکری، گھوڑے، خچر وغیرہ جانوروں کو تم نے نہیں بنایا اللہ نے اپنے دست قدرت سے پیدا کیا ہے۔ پھر تم کو محض اپنے فضل سے ان کا مالک بنا دیا کہ جہاں چاہو پہچو اور جو چاہو کام لو۔"
  },
  {
    "id": "72",
    "text": "وَذَلَّلْنَاهَا لَهُمْ فَمِنْهَا رَكُوبُهُمْ وَمِنْهَا يَأْكُلُونَ",
    "translate": "اور انہیں ان کے بس میں کر دیا ہے پھر ان میں سے کسی پر چڑھتے ہیں اور کسی کو کھاتے ہیں",
    "tafsir": ""
  },
  {
    "id": "73",
    "text": "وَلَهُمْ فِيهَا مَنَافِعُ وَمَشَارِبُ ۖ أَفَلَا يَشْكُرُونَ",
    "translate": "اور ان کے لیے ان میں اور بہت سے فائدے اور پینے کی چیزیں ہیں پھر کیوں شکر نہیں کرتے ف4",
    "tafsir": "ف4 دیکھو کتنے بڑے بڑے عظیم الجثہ قوی ہیکل جانور انسان تضعیت البنیان کے سامنے عاجز و مسخر کر دیے۔ مزاروں اونٹوں کی قطار کو ایک خورد سال بچہ نکیل پکڑ کر جدھر چاہے لے جائے ذرا کان نہیں جاتے۔ کیسے کیسے نہ زور جانوروں پر آدمی سواری کرتا ہے اور بعض کو کاٹ کر اپنی غذا بناتا ہے۔ علاوہ گوشت کھانے کے ان کی کھال بڑی اون وغیرہ سے کس قدر فوائد حاصل کیے جاتے ہیں ان کے تحن کیا ہیں گویا دودھ کے چیٹھے ہیں ان ہی چشموں کے گھاٹ سے کتنے آدمی سیراب ہوتے ہیں۔ لیکن شکر گزار بندے بہت تھوڑے ہیں۔"
  },
  {
    "id": "74",
    "text": "وَاتَّخَذُوا مِنْ دُونِ اللَّهِ آلِهَةً لَعَلَّهُمْ يُنْصَرُونَ",
    "translate": "اور الله کے سوا انہوں نے اور معبود بنا رکھے ہیں تاکہ وہ ان کی مدد کریں",
    "tafsir": ""
  },
  {
    "id": "75",
    "text": "لَا يَسْتَطِيعُونَ نَصْرَهُمْ وَهُمْ لَهُمْ جُنْدٌ مُحْضَرُونَ",
    "translate": "وہ ان کی مدد نہیں کر سکیں گے اور وہ ان کے حق میں ایک فریق (مخالف) ہوں گے جو حاضر کیے جائیں گے ف5",
    "tafsir": "ف5 عنی جس خدا نے یہ نعمتیں مرحمت فرمائیں اس کا یہ شکر ادا کیا کہ اس کے مقابل دوسرے احکام اور معبود شهرا لیے جنہیں سمجھتے ہیں کہ آڑے وقت میں کام آئیں گے اور مدد کریں گے سو یاد رکھو! وہ تمہاری تو کیا اپنی مدد بھی نہیں کر سکتے۔ ہاں جب تم کو مدد کی ضرورت ہو گی اس وقت گرفتار ضرور کرا دیں گے تب پتہ لگے گا کہ مین کی حمایت میں عمر بھر لڑتے رہے تھے وہ آج کس طرح آنکھیں دکھانے لگے۔"
  },
  {
    "id": "76",
    "text": "فَلَا يَحْزُنْكَ قَوْلُهُمْ ۘ إِنَّا نَعْلَمُ مَا يُسِرُّونَ وَمَا يُعْلِنُونَ",
    "translate": "پھر آپ ان کی بات سے غمزدہ نہ ہوں بے شک ہم جانتے ہیں جو وہ چھپاتے ہیں اور جو ظاہر کرتے ہیں ف6",
    "tafsir": "ف6 یعنی جب خود ہمارے ساتھ ان کا یہ معاملہ ہے تو آپ ان کی بات سے غمگین و دلگیر نہ ہوں۔ اپنا فرض ادا کر کے ہمارے حوالہ کریں۔ ہم ان کے ظاہری و باطنی احوال سے خوب واقلت ہیں ٹھیک ٹھیک بھگتان کر دیں گے۔"
  },
  {
    "id": "77",
    "text": "أَوَلَمْ يَرَ الْإِنْسَانُ أَنَّا خَلَقْنَاهُ مِنْ نُطْفَةٍ فَإِذَا هُوَ خَصِيمٌ مُبِينٌ",
    "translate": "کیا آدمی نہیں جانتاکہ ہم نے اسے منی کے ایک قطرے سے بنایا ہے پھر وہ کھلم کھلا دشمن بن کر جھگڑنے لگا ف7",
    "tafsir": "ف7 عنی انسان اپنی اصل کو یاد نہیں رکھتا کہ وہ ایک ناچیز قطرہ تھا، خدا نے کیا سے کیا بنا دیا۔ اس پانی کی بوند کو وہ زور اور قوت گویائی عطا کی کہ بات بات پر جھگڑنے اور باتیں بنانے لگا۔ حتی کہ آج اپنی حد سے بڑھ کر خالق کے مقابلہ میں خم ٹھونک کر کھڑا ہو گیا۔"
  },
  {
    "id": "78",
    "text": "وَضَرَبَ لَنَا مَثَلًا وَنَسِيَ خَلْقَهُ ۖ قَالَ مَنْ يُحْيِي الْعِظَامَ وَهِيَ رَمِيمٌ",
    "translate": "اور ہماری نسبت باتیں بنانے لگا اور اپنا پیدا ہونا بھول گیا کہنے لگا بوسیدہ ہڈیوں کو کون زندہ کر سکتا ہے ف8",
    "tafsir": "ف8 یعنی دیکھتے ہوا ندا پر کیسے فقرے چسپاں کرتا ہے۔ گویا اس قادر مطلق کو حاجز مخلوق کی طرح فرض کرلیا ہے جو کہتا ہے کہ آخر جب بدن گل سڑ کر صرف مڈیاں رہ گئیں وہ بھی بوسیدہ پرانی اور کھوکھلی، تو انہیں دوبارہ گون زندہ کرے گا۔ ایسا سوال کرتے وقت اسے اپنی پیدائش یاد نہیں رہی ورنہ اس قطر و ناچیز کو ایسے الفاظ کھنے کی جرات نہ ہوئی۔ اپنی اصل پر نظر کر کے کچھ مشرماتا اور کچھ عقل سے کام لے کر اپنے سوال کا جواب بھی حاصل کر لیتا جو اگلی آیت میں مذکور ہے۔"
  },
  {
    "id": "79",
    "text": "قُلْ يُحْيِيهَا الَّذِي أَنْشَأَهَا أَوَّلَ مَرَّةٍ ۖ وَهُوَ بِكُلِّ خَلْقٍ عَلِيمٌ",
    "translate": "کہہ دوانہیں وہی زندہ کرے گا جس نے انہیں پہلی بار پیدا کیا تھا اور وہ سب کچھ بنانا جانتا ہے ف9",
    "tafsir": "ف9 عنی جس نے پہلی مرتبہ ان ہڈیوں میں جان ڈالی اسے دوسری بار جان ڈالنا کیا مشکل ہے۔ بلکہ پہلے سے زیادہ انسان ہونا چاہیے۔ (وہو اہوں علیہ) اور اس قادر مطلق کے لیے تو سب ہی چیز آسان ہے پہلی مرتبہ ہو یا دوسری مرتبہ، وہ ہر طرح بنانا جانتا ہے اور بدن کے اجزاء اور ہڈیوں کے ریزے جہاں کہیں منتشر ہوگئے ہوں ان کا ایک ایک ذرہ اس کے علم میں ہے۔"
  },
  {
    "id": "80",
    "text": "الَّذِي جَعَلَ لَكُمْ مِنَ الشَّجَرِ الْأَخْضَرِ نَارًا فَإِذَا أَنْتُمْ مِنْهُ تُوقِدُونَ",
    "translate": "وہ جس نے تمہارے لیے سبز درخت سے آگ پیدا کر دی کہ تم جھٹ پٹ اس سے آگ سلگا لیتے ہو ف10",
    "tafsir": "ف10 یعنی اول پانی سے سر سبز و شاداب درخت تیار کیا پھر اسی تروتازہ درخت کو سکھا کر ایندھن بنا دیا جس سے اب تم گل نکال رہے ہو۔ پس جو خدا ایسی متعناد صفات کو ادل بدل سکتا ہے کیا وہ ایک چیز کی موت و حیات کے الٹ پھیر پر قادر نہیں ؟ ( تنبیہ) بعض سلف نے \"شجر اخضر \" (سبز درخت) سے ناس وہ درخت مراد لیے ہیں جن کی شاخوں کو آپس میں رگڑنے سے آگ نکلتی ہو۔ جیسے بانس کا درخت ہے یا عرب میں مرغ اور عفار تھے۔ واللہ اعلم ۔"
  },
  {
    "id": "81",
    "text": "أَوَلَيْسَ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ بِقَادِرٍ عَلَىٰ أَنْ يَخْلُقَ مِثْلَهُمْ ۚ بَلَىٰ وَهُوَ الْخَلَّاقُ الْعَلِيمُ",
    "translate": "کیا وہ جس نے آسمانوں اور زمین کو بنا دیا اس پر قاد رنہیں کہ ان جیسے اور بنائے کیوں نہیں وہ بہت کچھ بنانے ولا ماہر ہے ف1",
    "tafsir": "ف1 یعنی جس نے آسمان و زمین جیسی بڑی بڑی چیزیں پیدا کیں اسے ان کافروں جیسی چھوٹی چیزوں کا پیدا کر دینا کیا مشکل ہے۔"
  },
  {
    "id": "82",
    "text": "إِنَّمَا أَمْرُهُ إِذَا أَرَادَ شَيْئًا أَنْ يَقُولَ لَهُ كُنْ فَيَكُونُ",
    "translate": "اس کی تو یہ شان ہے کہ جب وہ کسی چیز کا ارادہ کرتا ہے تو اتنا ہی فرما دیتا ہے کہ ہو سو وہ ہو جاتی ہے ف2",
    "tafsir": "ف2 یعنی کسی چھوٹی بڑی چیز کے پہلی مرتبہ یا دوبارہ بنانے میں اسے وقت ہی کیا ہوسکتی ہے اس کے ہاں تو اس ارادہ کی دیر ہے جہاں کسی چیز کے پیدا کرنے کا ارادہ کیا اور کہا ہو جا! فورا ہو ئی رکھی ہے۔ ایک سیکنڈ کی تاخیر نہیں ہو سکتی۔ (تنبیہ) میرے خیال میں اس آیت کو پہلی آیت کے ساتھ ملا کر یوں بھی کہا جاسکتا ہے کہ پہلے خلق بدن کا ذکر تھا یہاں نفخ رون کا مطلب سمجھا دیا۔ واللہ اعلم۔ راحج وفوائد سورة الاسراء تحت بحث الروح -"
  },
  {
    "id": "83",
    "text": "فَسُبْحَانَ الَّذِي بِيَدِهِ مَلَكُوتُ كُلِّ شَيْءٍ وَإِلَيْهِ تُرْجَعُونَ",
    "translate": "پس وہ ذات پاک ہے جس کے ہاتھ میں ہر چیز کا کامل اختیار ہے اور اسی کی طرف تم لوٹائے جاؤ گے ف3",
    "tafsir": "ف3 عنی وہ اعلی ترین ہستی جس کے ہاتھ میں فی الحال بھی اوپر سے نیچے تک تمام مخلوقات کی زمام حکومت ہے اور آئندہ بھی اسی کی طرف سب کو لوٹ کر جانا ہے۔ پاک ہے عجزو سفہ اور ہر قسم کے عیب و نقص سے تم سورۃ يس ولله الحمد والمنتہ۔"
  }
]